{"config": {"output_layers": [["maxpooling2d_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 3, 32, 32], "input_dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"nb_row": 3, "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "th", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_1", "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_filter": 32}, "class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"nb_row": 3, "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "th", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_2", "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_filter": 16}, "class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"nb_row": 3, "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "th", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_3", "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_filter": 8}, "class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}]}, "class_name": "Model", "keras_version": "1.1.1"}