{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 3, 32, 32], "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "th", "input_dtype": "float32", "bias": true, "W_regularizer": null, "W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "nb_row": 3, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "th", "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activation": "linear", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "th", "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 128, "W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activation": "linear", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "th", "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 128, "W_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activation": "linear", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "th", "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 256, "W_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activation": "linear", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "th", "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 256, "W_constraint": null, "name": "convolution2d_6", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activation": "linear", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "activation": "linear", "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "activation": "linear", "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 128}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "activation": "linear", "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 32}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "activation": "linear", "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_10"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}