{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 128], "output_dim": 64, "trainable": true, "input_dim": null, "W_constraint": null, "name": "dense_1", "activation": "linear", "b_constraint": null, "bias": true, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "output_dim": 128, "trainable": true, "input_dim": null, "W_constraint": null, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "output_dim": 256, "trainable": true, "input_dim": null, "W_constraint": null, "name": "dense_3", "activation": "linear", "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "output_dim": 10, "trainable": true, "input_dim": null, "W_constraint": null, "name": "dense_4", "activation": "linear", "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "softmax"}}], "keras_version": "1.1.1"}